#Даны два целых числа: A, B. Проверить истинность высказывания: "Числа A и B имеют одинаковую четность"

A = 1
B = 3
print(A%2 == B%2)

# Даны три целых числа: A, B, C. Проверить истинность высказывания: "Хотя бы одно из чисел A, B, C положительное".

A = 0 
B = -10
C = -10

print(A > 0 or B > 0 or C > 0)


x = 673543245879
print(x % 10)
